In [11]:
import numpy as np
import pandas as pd

In [12]:
data = np.random.randn(4,3)

In [13]:
data

array([[ 1.1513731 ,  1.8636842 , -0.80438699],
       [-1.35854575, -1.08824295,  0.81994318],
       [-0.76583961,  1.08926762, -1.0810302 ],
       [ 0.18923776, -0.71287532,  1.28401207]])

In [14]:
data_frame = pd.DataFrame(data)

In [15]:
data_frame

          0         1         2
0  1.151373  1.863684 -0.804387
1 -1.358546 -1.088243  0.819943
2 -0.765840  1.089268 -1.081030
3  0.189238 -0.712875  1.284012

In [16]:
data_frame[2]

0   -0.804387
1    0.819943
2   -1.081030
3    1.284012
Name: 2, dtype: float64

In [19]:
new_df = pd.DataFrame(data,index=["Mert","Yiğit","Can","Berk"],columns=["Note","Age","Date"])

In [20]:
new_df["Age"]

Mert     1.863684
Yiğit   -1.088243
Can      1.089268
Berk    -0.712875
Name: Age, dtype: float64

In [21]:
new_df

           Note       Age      Date
Mert   1.151373  1.863684 -0.804387
Yiğit -1.358546 -1.088243  0.819943
Can   -0.765840  1.089268 -1.081030
Berk   0.189238 -0.712875  1.284012

In [22]:
new_df[["Age","Note"]]

            Age      Note
Mert   1.863684  1.151373
Yiğit -1.088243 -1.358546
Can    1.089268 -0.765840
Berk  -0.712875  0.189238

In [24]:
new_df.loc["Yiğit"]
#row için

Note   -1.358546
Age    -1.088243
Date    0.819943
Name: Yiğit, dtype: float64

In [26]:
new_df.iloc[:,1]
#bütün rowları seç

Mert     1.863684
Yiğit   -1.088243
Can      1.089268
Berk    -0.712875
Name: Age, dtype: float64

In [27]:
new_df["Col"]=12

In [28]:
new_df

           Note       Age      Date  Col
Mert   1.151373  1.863684 -0.804387   12
Yiğit -1.358546 -1.088243  0.819943   12
Can   -0.765840  1.089268 -1.081030   12
Berk   0.189238 -0.712875  1.284012   12

In [30]:
new_df.drop("Col",axis=1)
#axis=0 → satırlar üzerinde işlem yapar (index’e göre).
#axis=1 → sütunlar üzerinde işlem yapar (column’a göre).

           Note       Age      Date
Mert   1.151373  1.863684 -0.804387
Yiğit -1.358546 -1.088243  0.819943
Can   -0.765840  1.089268 -1.081030
Berk   0.189238 -0.712875  1.284012

In [35]:
new_df["Col"]=12

In [36]:
new_df.drop("Col",axis=1,inplace=True)
#inplace=False → güvenli, çünkü orijinal veri bozulmaz.
#inplace=True → doğrudan değiştirir, fazladan atama yapmana gerek kalmaz.

In [37]:
new_df

           Note       Age      Date
Mert   1.151373  1.863684 -0.804387
Yiğit -1.358546 -1.088243  0.819943
Can   -0.765840  1.089268 -1.081030
Berk   0.189238 -0.712875  1.284012

In [39]:
new_df.loc["Mert"]["Age"]

np.float64(1.86368419523792)

In [40]:
new_df.loc["Mert","Age"]

np.float64(1.86368419523792)

In [41]:
new_df.loc["Mert","Age"]=250

In [42]:
new_df

           Note         Age      Date
Mert   1.151373  250.000000 -0.804387
Yiğit -1.358546   -1.088243  0.819943
Can   -0.765840    1.089268 -1.081030
Berk   0.189238   -0.712875  1.284012

In [43]:
new_df > 0

        Note    Age   Date
Mert    True   True  False
Yiğit  False  False   True
Can    False   True  False
Berk    True  False   True

In [44]:
new_df[new_df >0 ]

           Note         Age      Date
Mert   1.151373  250.000000       NaN
Yiğit       NaN         NaN  0.819943
Can         NaN    1.089268       NaN
Berk   0.189238         NaN  1.284012

In [45]:
new_df[new_df["Note"]>1]

          Note    Age      Date
Mert  1.151373  250.0 -0.804387

In [48]:
new_df.reset_index(inplace=True)

In [49]:
new_df

   index      Note         Age      Date
0   Mert  1.151373  250.000000 -0.804387
1  Yiğit -1.358546   -1.088243  0.819943
2    Can -0.765840    1.089268 -1.081030
3   Berk  0.189238   -0.712875  1.284012

In [52]:
new_index=["z","E","A","b"]

In [56]:
new_df["NewIndex"]=new_index

In [57]:
new_df

   index      Note         Age      Date newIndex NewIndex
0   Mert  1.151373  250.000000 -0.804387        z        z
1  Yiğit -1.358546   -1.088243  0.819943        E        E
2    Can -0.765840    1.089268 -1.081030        A        A
3   Berk  0.189238   -0.712875  1.284012        b        b

In [58]:
new_df.set_index("NewIndex",inplace=True)

In [59]:
new_df

          index      Note         Age      Date newIndex
NewIndex
z          Mert  1.151373  250.000000 -0.804387        z
E         Yiğit -1.358546   -1.088243  0.819943        E
A           Can -0.765840    1.089268 -1.081030        A
b          Berk  0.189238   -0.712875  1.284012        b

In [60]:
#multi index birden fazla index olduğu durumlar

In [62]:
first_index=["Mustafa","Kemal","Can","Yiğit"]

In [69]:
inner_index=["Homer","Bart","Marge","Adana"]

In [70]:
zipped_index=list(zip(first_index,inner_index))

In [71]:
zipped_index

[('Mustafa', 'Homer'), ('Kemal', 'Bart'), ('Can', 'Marge'), ('Yiğit', 'Adana')]

In [72]:
zipped_index=pd.MultiIndex.from_tuples(zipped_index)

In [73]:
zipped_index

MultiIndex([('Mustafa', 'Homer'),
            (  'Kemal',  'Bart'),
            (    'Can', 'Marge'),
            (  'Yiğit', 'Adana')],
           )